# Importing data into pandas

There are tons of ways you can get data into a pandas dataframe. Here are a few of the more common ones.

First, let's import pandas `as` pd.

In [2]:
import pandas as pd

### From a CSV file

If your data file is delimited with something other than a comma, you'll need to specify that in the `sep` argument. For example: `pd.read_csv('../data/my-delimited-file.txt', sep='|')`

Let's read in the MLB salary data.

In [3]:
csv_df = pd.read_csv('../data/mlb.csv')

In [4]:
csv_df.head()

               NAME TEAM POS    SALARY  START_YEAR  END_YEAR  YEARS
0   Clayton Kershaw  LAD  SP  33000000        2014      2020      7
1      Zack Greinke  ARI  SP  31876966        2016      2021      6
2       David Price  BOS  SP  30000000        2016      2022      7
3    Miguel Cabrera  DET  1B  28000000        2014      2023     10
4  Justin Verlander  DET  SP  28000000        2013      2019      7

### From a CSV file on the Internet

Just pass in the URL. This example uses the official results of the fall 2016 election in Nebraska.

In [4]:
csvi_df = pd.read_csv('http://electionresults.sos.ne.gov/resultsCSV.aspx?text=All')

In [5]:
csvi_df.head()

,RaceID,RaceName,PartyCode,AreaType,AreaNum,OfficeSeqNo,BallotOrder,CandidateID,CandidateName,CurrentDateTime,VoteFor,CandidateVotes,CandidatePercentage,PrecinctsReporting,PartialPrecinctsReporting
8862,For United States Senator - 6 Year Term,REP,SW,NaN,102,NaN,81,Jack Heidel,5/12/2018 6:44:14 AM,1,0,0,0/1464,0/1464,NaN
8862,For United States Senator - 6 Year Term,REP,SW,NaN,102,NaN,1437,Dennis Frank Macek,5/12/2018 6:44:14 AM,1,0,0,0/1464,0/1464,NaN
8862,For United States Senator - 6 Year Term,REP,SW,NaN,102,NaN,193,Deb Fischer,5/12/2018 6:44:14 AM,1,0,0,0/1464,0/1464,NaN
8862,For United States Senator - 6 Year Term,REP,SW,NaN,102,NaN,1269,Jeffrey Lynn Stein,5/12/2018 6:44:14 AM,1,0,0,0/1464,0/1464,NaN
8862,For United States Senator - 6 Year Term,REP,SW,NaN,102,NaN,1253,Todd F. Watson,5/12/2018 6:44:14 AM,1,0,0,0/1464,0/1464,NaN

### From an Excel file

If you hadn't done this already, you'd need to install the [`xlrd`](http://www.python-excel.org/) module. (If you're using pipenv, the command would be: `pipenv install xlrd`)

You might want to specify the `sheet_name` to select a worksheet -- the default is "the first one."

In [8]:
xl_df = pd.read_excel('../data/homicides2014.xlsx', sheet_name='Murders')

In [9]:
xl_df.head()

             City State  Population  Murders
0  New York City     NY     8473938      333
1    Los Angeles     CA     3906772      260
2        Chicago     IL     2724121      415
3        Houston     TX     2219933      242
4   Philadelphia     PA     1559062      248

### From a Python data collection

Maybe the work you're doing in pandas happens downstream of some other Python processing, so the data exists as a native Python data collection -- say, a list of dictionaries. You can turn this (and other Python data collections, like a list of lists) into a pandas dataframe, too.

ðŸ‘‰ For more details on Python data collections, [see this notebook](Python%20data%20types%20and%20basic%20syntax.ipynb#Collections-of-data).

In [11]:
test_data = [
    {'name': 'Cody Winchester', 'job': 'Training director', 'location': 'Colorado Springs, CO'},
    {'name': 'Matt Wynn', 'job': 'Data reporter', 'location': 'Omaha, NE'},
    {'name': 'Guy Fieri', 'job': 'Gourmand', 'location': 'Flavortown'},
    {'name': 'Sarah Huckabee Sanders', 'job': 'Spokeswoman', 'location': 'Washington, D.C.'}
]

py_df = pd.DataFrame(test_data)

In [12]:
py_df.head()

                 job              location                    name
0  Training director  Colorado Springs, CO         Cody Winchester
1      Data reporter             Omaha, NE               Matt Wynn
2           Gourmand            Flavortown               Guy Fieri
3        Spokeswoman      Washington, D.C.  Sarah Huckabee Sanders

### From an HTML table

This one requires you to install and specify the HTML parsing engine of your choice -- [BeautifulSoup](https://www.crummy.com/software/BeautifulSoup/bs4/doc/) or [lxml](http://lxml.de/). The default is `lxml`, but here we're going to use BeautifulSoup. Pulling data directly from an HTML table can be hit and miss, depending on how hairy the underlying HTML is. And if you want to scrape data from a website, it's usually better practice to save the results to a local file, _then_ load it up for analysis. But it's good to know that it's an option.

In this example, we've installed `BeautifulSoup` (alias `bs4`) with pipenv and we're going to import [a table of media witnesses](https://www.tdcj.state.tx.us/death_row/dr_media_witness_list.html) to Texas death row executions.

We're going to pass four things to [the pandas `read_html()` method](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_html.html):
1. A string containing the URL we want to scrape
2. The `flavor` of parser that we'd like to use to process the HTML (`bs4`)
3. The HTML attributes of the table we're targeting (in this case, the table has a `class` called `tdcj_table`)
4. The index number of the list, in the list of lists that gets returned in a dataframe, that is the `header`? (Usually it's 0 -- the first one)

Reading through the documentation for this method, we also notice that this method returns a _list_ of matching tables as datafranes, so we need to grab the _first_ item in this list of tables returned. Our arguments were specific enough that there's only one item in the returned list, though, so we can just grab the first item with `[0]`.

ðŸ‘‰For more details on selecting items from Python lists, see [this notebook](Python%20data%20types%20and%20basic%20syntax.ipynb#Collections-of-data).

In [14]:
html_df = pd.read_html('https://www.tdcj.state.tx.us/death_row/dr_media_witness_list.html',
                       flavor='bs4',
                       attrs={'class': 'tdcj_table'},
                       header=0)[0]

In [15]:
html_df.head()

,Execution,Link,Last Name,First Name,TDCJ Number,Date,Media Witness List
0,550,Offender Information,Davila,Erick,999545,04/25/2018,"Michael Graczyk, Associated Press; Cody Stark,..."
1,549,Offender Information,"Rodriguez, III",Rosendo,999534,3/27/2018,"Michael Graczyk, Associated Press; Cody Stark,..."
2,548,Offender Information,Battagllia,John,999412,2/1/2018,"Michael Graczyk, Associated Press; Cody Stark,..."
3,547,Offender Information,Rayford,William,999371,01/30/2018,"Michael Graczyk, Associated Press; Cody Stark,..."
4,546,Offender Information,Shore,Anthony,999488,01/18/2018,"Michael Graczyk, Associated Press; Cody Stark,..."

### From JSON

JSON stands for **J**ava**S**cript **O**bject **N**otation. It's a common data interchange format on the web.

Pandas can slurp in data from a local `.json` file, or from a URL -- say, a JSON API with data on dogs and cats registered in the Sunshine Coast Region of Australia.

In [16]:
json_df = pd.read_json('https://data.sunshinecoast.qld.gov.au/resource/44qj-t4fr.json')

In [17]:
json_df.head()

,age,animaltype,de_sexed,gender,locality,name,primarybreed,primarycolour,specificbreed
0,0,D,Y,M,LITTLE MOUNTAIN,Boris,STAFFR,White,STAFFRDBT
1,5,D,Y,F,PELICAN WATERS,Molly (was Pandora),MALTES,WhiteApric,MALTESEX
2,12,D,N,F,GHEERULLA,Mac,FOXTER,BlackTan,FOXTERRIEX
3,4,D,Y,M,GLASS HOUSE MOUNTAINS,Jax,BOXER,RedWhite,BOXER
4,8,D,Y,F,MOOLOOLAH VALLEY,Dililah,STAFFR,Brown,STAFFRDAM